In [1]:
import pandas as pd
import numpy as np

In [2]:
# импорт из csv файла 
csv_zip = pd.read_csv('D:/Pandas_classes/train/train.csv')
csv_zip.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# импорт из exel 
excel_data = pd.read_excel('D:/Pandas_classes/train/iris.xlsx')
excel_data.head()

   Petal_width  Petal_length  Sepal_width  Sepal_length Species_name
0          0.2           1.4          3.5           5.1       Setosa
1          0.2           1.4          3.0           4.9       Setosa
2          0.2           1.3          3.2           4.7       Setosa
3          0.2           1.5          3.1           4.6       Setosa
4          0.2           1.4          3.6           5.0       Setosa

In [4]:
# импорт html
html_data = pd.read_html('https://en.wikipedia.org/wiki/World_population', match = 'World population')
len(html_data)

5

In [5]:
html_data[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [6]:
# импорт из SQL 
import sqlite3 as sql

# создадим соединение с базой данный chinook
conn = sql.connect('d:/Pandas_classes/train/chinook.db')

sql_data = pd.read_sql('SELECT * FROM tracks', conn)

sql_data.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [7]:
# создание DataFrame из словаря
country = np.array(['China', 'Vietnam', 'United Kindom', 'Russia', 'Argentina', 'Bolivia', 'South Africa'])
capital = ['Beijing', 'Hanoi', 'London', 'Moscow', 'Buenos Aires', 'Sucre', 'Pretoria']
population = [1400, 97, 67, 144, 45, 12, 59]
area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2]
sea = [1] * 5 + [0, 1]

countries_dict = {}
# превратим списки в значения словаря снабдив ключами
countries_dict['country'] = country
countries_dict['capital'] = capital
countries_dict['population'] = population
countries_dict['area'] = area
countries_dict['sea'] = sea

countries = pd.DataFrame(countries_dict)
countries

         country       capital  population  area  sea
0          China       Beijing        1400   9.6    1
1        Vietnam         Hanoi          97   0.3    1
2  United Kindom        London          67   0.2    1
3         Russia        Moscow         144  17.1    1
4      Argentina  Buenos Aires          45   2.8    1
5        Bolivia         Sucre          12   1.1    0
6   South Africa      Pretoria          59   1.2    1

In [8]:
# создание DataFrame из 2В массива
arr = np.array([[1, 1, 1],
                [2, 2, 2],
                [3, 3, 3]])

pd.DataFrame(arr)

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

__Структура и свойства датафрейма__

In [9]:
# выведем столбцы датафрейма counties
countries.columns

Index(['country', 'capital', 'population', 'area', 'sea'], dtype='object')

In [10]:
# атрибут index описывает каким образом идентифицируются строки
countries.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
# атрибут values позволяет получить доступ к значениям датафрейма
countries.values

array([['China', 'Beijing', 1400, 9.6, 1],
       ['Vietnam', 'Hanoi', 97, 0.3, 1],
       ['United Kindom', 'London', 67, 0.2, 1],
       ['Russia', 'Moscow', 144, 17.1, 1],
       ['Argentina', 'Buenos Aires', 45, 2.8, 1],
       ['Bolivia', 'Sucre', 12, 1.1, 0],
       ['South Africa', 'Pretoria', 59, 1.2, 1]], dtype=object)

In [12]:
# выведем описание индекса датафрейма через атрибут axes[0]
countries.axes[0]

RangeIndex(start=0, stop=7, step=1)

In [13]:
# axes[1] выводит названия столбцов
countries.axes[1]

Index(['country', 'capital', 'population', 'area', 'sea'], dtype='object')

__axis = 0__ - позволяет применить какой-либо метод к строкам датафрейма  
__axis = 1__ - позволяет применить какой-либо метод к столбцам датафрейма

In [14]:
# количество измерений
countries.ndim

2

In [15]:
# размерность
countries.shape

(7, 5)

In [16]:
# общее количество элементов
countries.size

35

In [17]:
# атрибут dtypes выдает тип данных каждого столбца
countries.dtypes

country        object
capital        object
population      int64
area          float64
sea             int64
dtype: object

In [18]:
# метод memory_usage() позволяет посмотреть объем занимаемой памяти по столбцам в байтах
countries.memory_usage()

Index         132
country        56
capital        56
population     56
area           56
sea            56
dtype: int64

__Индекс__  
По умолчанию при создании датафрейма библиотека Pandas снабжает его числовым индексом, который начинается с нуля. При этом мы можем присвоить датафрейму собственный индекс.

In [19]:
# присвоение индекса
custom_index = ['CN', 'VN', 'GB', 'RU', 'AR', 'BO', 'ZA']

countries = pd.DataFrame(countries_dict, index = custom_index)
countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

In [20]:
# этот индекс можно сбросить с помощью metoda reset.index()
# параметр inplace = True сделает изменения постоянными

countries.reset_index(inplace = True)
countries

  index        country       capital  population  area  sea
0    CN          China       Beijing        1400   9.6    1
1    VN        Vietnam         Hanoi          97   0.3    1
2    GB  United Kindom        London          67   0.2    1
3    RU         Russia        Moscow         144  17.1    1
4    AR      Argentina  Buenos Aires          45   2.8    1
5    BO        Bolivia         Sucre          12   1.1    0
6    ZA   South Africa      Pretoria          59   1.2    1

In [21]:
# Снова сделаем этот столбец индексом с помощью метода .set_index().
countries.set_index('index', inplace = True)
countries

             country       capital  population  area  sea
index
CN             China       Beijing        1400   9.6    1
VN           Vietnam         Hanoi          97   0.3    1
GB     United Kindom        London          67   0.2    1
RU            Russia        Moscow         144  17.1    1
AR         Argentina  Buenos Aires          45   2.8    1
BO           Bolivia         Sucre          12   1.1    0
ZA      South Africa      Pretoria          59   1.2    1

In [22]:
# Еще раз сбросим индекс, но на этот раз не будем делать его отдельным столбцом. Для этого передадим методу .reset_index() параметр drop = True.
countries.reset_index(drop = True, inplace = True)
countries

         country       capital  population  area  sea
0          China       Beijing        1400   9.6    1
1        Vietnam         Hanoi          97   0.3    1
2  United Kindom        London          67   0.2    1
3         Russia        Moscow         144  17.1    1
4      Argentina  Buenos Aires          45   2.8    1
5        Bolivia         Sucre          12   1.1    0
6   South Africa      Pretoria          59   1.2    1

In [23]:
# собственный индекс можно создать просто поместив новые значения в атрибут index
countries.index = custom_index
countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

__Многоуровневый индекс__  
Многоуровневый (MultiIndex) или иерархический (hierarchical) индекс позволяет задать несколько уровней (levels) для индексации строк или столбцов. «Внешний» индекс объединяет несколько элементов «внутреннего» индекса.

In [24]:
rows = [('Asia', 'CN'),
        ('Asia', 'VN'),
        ('Europe', 'GB'),
        ('Europe', 'RU'),
        ('S. America', 'AR'),
        ('S. America', 'BO'),
        ('Africa', 'ZA')]

cols = [('names', 'country'),
        ('names', 'capital'),
        ('data', 'population'),
        ('data', 'area'),
        ('data', 'sea')]

In [25]:
custom_multindex = pd.MultiIndex.from_tuples(rows, names = ['region', 'code'])

In [26]:
custom_multicols = pd.MultiIndex.from_tuples(cols)

In [27]:
countries.index = custom_multindex
countries.columns = custom_multicols
 
countries

                         names                     data
                       country       capital population  area sea
region     code
Asia       CN            China       Beijing       1400   9.6   1
           VN          Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kindom        London         67   0.2   1
           RU           Russia        Moscow        144  17.1   1
S. America AR        Argentina  Buenos Aires         45   2.8   1
           BO          Bolivia         Sucre         12   1.1   0
Africa     ZA     South Africa      Pretoria         59   1.2   1

In [28]:
# вернемся к обычному индексу и названиям столбцов
custom_cols = ['country', 'capital', 'population', 'area', 'sea']

countries.index = custom_index
countries.columns = custom_cols

countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

### __Преобразование в другие форматы__

__.to_dict()__ - преобразование в словарь

In [29]:
print(countries.to_dict())

{'country': {'CN': 'China', 'VN': 'Vietnam', 'GB': 'United Kindom', 'RU': 'Russia', 'AR': 'Argentina', 'BO': 'Bolivia', 'ZA': 'South Africa'}, 'capital': {'CN': 'Beijing', 'VN': 'Hanoi', 'GB': 'London', 'RU': 'Moscow', 'AR': 'Buenos Aires', 'BO': 'Sucre', 'ZA': 'Pretoria'}, 'population': {'CN': 1400, 'VN': 97, 'GB': 67, 'RU': 144, 'AR': 45, 'BO': 12, 'ZA': 59}, 'area': {'CN': 9.6, 'VN': 0.3, 'GB': 0.2, 'RU': 17.1, 'AR': 2.8, 'BO': 1.1, 'ZA': 1.2}, 'sea': {'CN': 1, 'VN': 1, 'GB': 1, 'RU': 1, 'AR': 1, 'BO': 0, 'ZA': 1}}

__.to_numpy()__ преобразование в массив Numpy

In [30]:
countries.to_numpy()

array([['China', 'Beijing', 1400, 9.6, 1],
       ['Vietnam', 'Hanoi', 97, 0.3, 1],
       ['United Kindom', 'London', 67, 0.2, 1],
       ['Russia', 'Moscow', 144, 17.1, 1],
       ['Argentina', 'Buenos Aires', 45, 2.8, 1],
       ['Bolivia', 'Sucre', 12, 1.1, 0],
       ['South Africa', 'Pretoria', 59, 1.2, 1]], dtype=object)

__.to_list()__ - преобразование столбца в список

In [31]:
print(countries.country.to_list())

['China', 'Vietnam', 'United Kindom', 'Russia', 'Argentina', 'Bolivia', 'South Africa']

### __Создание Series__

__Создание Series из списка__

In [32]:
country_list = ['China', 'South Africa', 'United Kingdom', 'Russia', 'Argentina', 'Vietnam', 'Australia']

In [33]:
country_Series = pd.Series(country_list)
country_Series

0             China
1      South Africa
2    United Kingdom
3            Russia
4         Argentina
5           Vietnam
6         Australia
dtype: object

__Создание Series из словаря__

In [34]:
country_dict = {'CN' : 'China',
                'ZA' : 'South Africa',
                'GB' : 'United Kingdom',
                'RU' : 'Russian',
                'AR' : 'Argentina',
                'VN' : 'Vietnam',
                'AU' : 'Australia'
               }

In [35]:
country_Series = pd.Series(country_dict)
country_Series

CN             China
ZA      South Africa
GB    United Kingdom
RU           Russian
AR         Argentina
VN           Vietnam
AU         Australia
dtype: object

In [36]:
country_Series['RU']

'Russian'

### __Доступ к строкам, столбцам и элементам__

__Циклы в датафрейме__

In [37]:
# цикл for позволяет получить доступ к названию столбцов DataFrame
for column in countries:
    print(column)

country
capital
population
area
sea

__метод .iterrows()__ - возвращает индекс строки и ее содержимое в формате Series

In [38]:
for index, row in countries.iterrows():
    print(index)
    print(row)
    print('...')
    print(type(row))
    break

CN
country         China
capital       Beijing
population       1400
area              9.6
sea                 1
Name: CN, dtype: object
...
<class 'pandas.core.series.Series'>

In [39]:
# получить доступ к элементам одной строки можно по индексу объекта Series
# т.е. по названиям столбцов исходного датафрейма)
for _, row in countries.iterrows():
    print(row['capital'] + ' is the capital of ' + row['country'])

Beijing is the capital of China
Hanoi is the capital of Vietnam
London is the capital of United Kindom
Moscow is the capital of Russia
Buenos Aires is the capital of Argentina
Sucre is the capital of Bolivia
Pretoria is the capital of South Africa

### __Доступ к столбцам__

In [40]:
# выведем столбец capital датафрейма countries
countries['capital']

CN         Beijing
VN           Hanoi
GB          London
RU          Moscow
AR    Buenos Aires
BO           Sucre
ZA        Pretoria
Name: capital, dtype: object

In [41]:
# так же можно получить доступ к столбцу через точку
countries.capital

CN         Beijing
VN           Hanoi
GB          London
RU          Moscow
AR    Buenos Aires
BO           Sucre
ZA        Pretoria
Name: capital, dtype: object

In [42]:
# отдельные столбцы в DataFrame имеют тип данных Series
type(countries.capital)

pandas.core.series.Series

In [43]:
# чтобы получить доступ к столбцам и при этом сформаровать DataFrame необходимо использовать двойные скобки
# внутренние скобки - это список, внешние - оператор индексации
countries[['capital']]

         capital
CN       Beijing
VN         Hanoi
GB        London
RU        Moscow
AR  Buenos Aires
BO         Sucre
ZA      Pretoria

In [44]:
type(countries[['capital']])

pandas.core.frame.DataFrame

In [45]:
# можно получить доступ к нескольким столбцам
countries[['capital', 'area']]

         capital  area
CN       Beijing   9.6
VN         Hanoi   0.3
GB        London   0.2
RU        Moscow  17.1
AR  Buenos Aires   2.8
BO         Sucre   1.1
ZA      Pretoria   1.2

In [46]:
# можно получить доступ используя метод .filter(), передав параметру items список нужных столбцов
countries.filter(items = ['capital', 'population'])

         capital  population
CN       Beijing        1400
VN         Hanoi          97
GB        London          67
RU        Moscow         144
AR  Buenos Aires          45
BO         Sucre          12
ZA      Pretoria          59

### __Доступ к строкам__

In [47]:
# выведем строки со второй по пятую (не включительно)
countries[1:5]

          country       capital  population  area  sea
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1

### __Методы .loc[] и .iloc[]__

__Метод .loc[]__ - позволяет получить доступ к строкам и столбцам через их названия (label-based location).

In [48]:
# для этого передадим методу .loc[] два списка: с индексами строк и названиями столбцов
countries.loc[['CN', 'RU', 'VN'], ['capital', 'population', 'area']]

    capital  population  area
CN  Beijing        1400   9.6
RU   Moscow         144  17.1
VN    Hanoi          97   0.3

In [49]:
# через двоеточие можно вывести все строки или все столбцы датафрейма
countries.loc[:, ['capital', 'population', 'area']]

         capital  population  area
CN       Beijing        1400   9.6
VN         Hanoi          97   0.3
GB        London          67   0.2
RU        Moscow         144  17.1
AR  Buenos Aires          45   2.8
BO         Sucre          12   1.1
ZA      Pretoria          59   1.2

In [50]:
# .loc[] поддерживает значение Boolean
countries.loc[:, [False, False, False, False, True]]

    sea
CN    1
VN    1
GB    1
RU    1
AR    1
BO    0
ZA    1

__Метод get_loc()__ - позволяет узнать порядковый номер (начиная с нуля) строки или столбца по их индексу и названию соответственно

In [51]:
countries.index.get_loc('RU')

3

In [52]:
countries.columns.get_loc('country')

0

__Метод .iloc[]__ - действует примерно также, как и .loc[], с тем отличием, что он основывается на числовом индексе (integer-based location)

In [53]:
# теперь в списки мы подаем номера строк и столбцов, нумерация начинается с нуля
countries.iloc[[0, 3, 5], [0, 1, 2]]

    country  capital  population
CN    China  Beijing        1400
RU   Russia   Moscow         144
BO  Bolivia    Sucre          12

In [54]:
# можно использовать срезы
countries.iloc[:3, -2:]

    area  sea
CN   9.6    1
VN   0.3    1
GB   0.2    1

In [55]:
# к столбцам удобно обращаться по их названию, а к строкам - по порядковому номеру
countries[['population', 'area']].iloc[[0, 3]]

    population  area
CN        1400   9.6
RU         144  17.1

### __Многоуровневый индекс и методы .loc[] и .iloc[]__

In [56]:
# вновь создадим датафрейм с многоуровневым индексом по строкам и столбцам
countries.index = custom_multindex
countries.columns = custom_multicols

countries

                         names                     data
                       country       capital population  area sea
region     code
Asia       CN            China       Beijing       1400   9.6   1
           VN          Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kindom        London         67   0.2   1
           RU           Russia        Moscow        144  17.1   1
S. America AR        Argentina  Buenos Aires         45   2.8   1
           BO          Bolivia         Sucre         12   1.1   0
Africa     ZA     South Africa      Pretoria         59   1.2   1

In [57]:
# двойной индекс
countries.loc['Asia', 'CN']

names  country         China
       capital       Beijing
data   population       1400
       area              9.6
       sea                 1
Name: (Asia, CN), dtype: object

In [58]:
# выведем первую строку и столбцы с числовыми данными
countries.loc[('Asia', 'CN'), [('data', 'population'), ('data', 'area'), ('data', 'sea')]]

data  population    1400.0
      area             9.6
      sea              1.0
Name: (Asia, CN), dtype: float64

In [59]:
# доступ можно получить указав внутри кортежа название региона и список с кодами стран
countries.loc[('Asia', ['CN', 'VN']), :]

               names                data
             country  capital population area sea
region code
Asia   CN      China  Beijing       1400  9.6   1
       VN    Vietnam    Hanoi         97  0.3   1

In [60]:
# можно указать только регион
countries.loc[('Asia'), :]

        names                data
      country  capital population area sea
code
CN      China  Beijing       1400  9.6   1
VN    Vietnam    Hanoi         97  0.3   1

In [61]:
# аналогичным образом мы можем получить доступ к столбцам
countries.loc[:, [('names', 'country'), ('data', 'population')]]

                         names       data
                       country population
region     code
Asia       CN            China       1400
           VN          Vietnam         97
Europe     GB    United Kindom         67
           RU           Russia        144
S. America AR        Argentina         45
           BO          Bolivia         12
Africa     ZA     South Africa         59

In [62]:
# метод .iloc[] игнорирует структуру иерархического индекса и использует простой числовой индекс
# получим доступ к четвертой строке и третьемуб четвертому, пятому столбцам
countries.iloc[3, [2, 3, 4]]

data  population    144.0
      area           17.1
      sea             1.0
Name: (Europe, RU), dtype: float64

__Метод .xs()__ - (от англ. cross-section, срез) позволяет получить доступ к определенному уровню иерархического индекса

In [63]:
# выберем Европу из уровня region 
# axis = 0 указывает, что мы берем строки
countries.xs('Europe', level = 'region', axis = 0)

              names               data
            country capital population  area sea
code
GB    United Kindom  London         67   0.2   1
RU           Russia  Moscow        144  17.1   1

In [64]:
# level указывает на каких уровнях искать искать названия столбцов
# параметр axis = 1 говорит о том, что мы берем столбцы
countries.xs(('names', 'country'), level = [0, 1], axis = 1)

                         names
                       country
region     code
Asia       CN            China
           VN          Vietnam
Europe     GB    United Kindom
           RU           Russia
S. America AR        Argentina
           BO          Bolivia
Africa     ZA     South Africa

In [65]:
# можно соеденить два уровня
# в данном случае мы можем не указывать level, потому что Europe и name 
# находятся во внешних индексах, которые в level указаны по умолчанию

countries.xs('Europe', axis = 0).xs(('names'), axis = 1)

            country capital
code
GB    United Kindom  London
RU           Russia  Moscow

In [66]:
# вернем одноуровневый индекс DataFrame
countries.index = custom_index
countries.columns = custom_cols

countries

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

__Метод .at[]__

In [67]:
countries.at['CN', 'capital']

'Beijing'

### __Фильтры__

__Логическая маска__

мы можем создать логическую маску (Boolean mask) датафрейма, в которой нежелательные значения будут помечены как False

In [69]:
# создадим логическую маску для стран с населением больше миллиарда человек
countries.population > 1000

CN     True
VN    False
GB    False
RU    False
AR    False
BO    False
ZA    False
Name: population, dtype: bool

In [70]:
# применим логическую маску к исходному датафрейму
countries[countries.population > 1000]

   country  capital  population  area  sea
CN   China  Beijing        1400   9.6    1

In [71]:
# можем применить две маски объединенные например логическим оператором И
# отфильтруем датафрейм по критериям численности населения и площади
countries[(countries.population > 50) & (countries.area < 2)]

          country   capital  population  area  sea
VN        Vietnam     Hanoi          97   0.3    1
GB  United Kindom    London          67   0.2    1
ZA   South Africa  Pretoria          59   1.2    1

Eще один вариант синтаксиса. Его удобно использовать, если у вас есть множество условий, по которым вы хотите отфильтровать датафрейм

In [72]:
# вначале создадин нужные нам маски
population_mask = countries.population > 70
area_mask = countries.area < 50

# затем объединяем их по необходимым условиям (в данном случае ИЛИ)
mask = population_mask | area_mask

countries[mask]

          country       capital  population  area  sea
CN          China       Beijing        1400   9.6    1
VN        Vietnam         Hanoi          97   0.3    1
GB  United Kindom        London          67   0.2    1
RU         Russia        Moscow         144  17.1    1
AR      Argentina  Buenos Aires          45   2.8    1
BO        Bolivia         Sucre          12   1.1    0
ZA   South Africa      Pretoria          59   1.2    1

__Метод .query()__ позволяет задавать условие фильтрации «своими словами».

In [73]:
# например, выберем страны с населением более 50 млн. человек И
# площадью менее двух млн. кв. километров
countries.query('population > 50 and area <2')

          country   capital  population  area  sea
VN        Vietnam     Hanoi          97   0.3    1
GB  United Kindom    London          67   0.2    1
ZA   South Africa  Pretoria          59   1.2    1

In [ ]:
# выведем данные по Великобритании
countries.query('country == Uni